{
    "jobs": [  
      {
        "id": 1,
        "title": "Junior IT Analyst",
        "date" :"April 2023 - August 2023",
        "org": "JANA Corporation",
        "description": ["Assist in project planning by gathering project requirements, creating project timelines, and contributing to the development of project plans","Review existing security policies and procedures, comparing them to industry best practices and providing recommendations for improvement", "Assist with cloud automation tools to automate routine tasks and streamline cloud operations", "Conducted Tabletop Exercises to improve existing cybersecurity measures"],
        "url": "https://www.janacorporation.com/"
      },
      {
        "id": 2,
        "title": "Lead Stack Developer",
        "date": "September 2023 - Present",
        "org": "Queen's Vertical Farming Team",
        "description": ["Leading a group of developers to redesign the design team website", "Redesigned the QVFT website in React, ensuring real-time visualization and updating of farm data", "Employed Flask to execute back-end development responsibilities", "Utilized PostgreSQL to store and manage incoming readings from the I/O sub-system"],
        "url": "https://www.qvft.ca/"
      },
      {
        "id": 3,
        "title": "Undergraduate Teaching Assistant",
        "date": "January 2024 - April 2024",
        "org": "Queen's University",
        "description": ["Educated and mentored as a TA for APSC 142, focusing on the C programming language.", "Directed and supervised approx. 200 students through hands-on assignments during weekly lab sessions and office hours."],
        "url": "https://www.queensu.ca/academic-calendar/search/?P=APSC%20142"
      },
      {
        "id": 4,
        "title": "Software Development Lead",
        "date": "January 2024 - August 2024",
        "org": "Evstry",
        "description": ["Created the Evstry website connecting CMS, Figma, Webflow, and React, achieving a 30% boost in consumer engagement.", "Guided a 5-man Agile Team software interns, accelerating task completion in less time expected."],
        "url": "https://www.evstry.com/"
      },
      {
        "id": 5,
        "title": "Machine Learning Developer",
        "date": "January 2024 - Present",
        "org": "GM-SAE AutoDrive Challenge II",
        "description": ["Engineered a sensor-fusion model using C++ and OpenCV, enhancing performance 25-fold.", "Created a script with OpenAI API to convert datasets to Microsoft VoTT format.", "Represented Queen's University at the GM-SAE AutoDrive Challenge II Winter Workshop in Michigan."],
        "url": "https://autodrive.engineering.queensu.ca/"
      },
      {
        "id": 6,
        "title": "AI & Technology Intern",
        "date": "May 2024 - August 2024",
        "org": "City of Orillia",
        "description": ["Implemented an AI HelpDesk Bot categorizing IT tickets, trained on 6000+ tickets.", "Authored and presented Generative AI guidelines to City Council; received approval and completed within 90 days.", "Consulted with 5 city-wide businesses, upgrading equipment and optimizing processes."],
        "url": "https://www.orillia.ca/en/index.aspx"
      }
    ]
}
