{
  "projects": [
    {
      "id": 1,
      "title": "Store Website: Spice Mart",
      "description": "I developed a customer-centric website that allows patrons to browse menu options and discover current promotions with ease. The site boasts a responsive front end, built Next.js and Tailwind CSS. At its core, a dynamic RESTful API built with Next.js Server enables staff to effortlessly manage menu updates, while the integration of Auth0 ensures secure administrator access for content control. Additionally, MongoDB Atlas underpins the system as the robust database solution, streamlining the management of menu data for an optimized user experience.",
      "tags": ["Next.js", "Tailwind", "React", "MongoDB"],
      "url": "https://spicemartbarrie.ca/",
      "github": "https://github.com/itsNairr/SpiceMart",
      "images": ["spicemart.png","spicemart-menu.png","spicemart-portal.png","spicemart-edit.png"]
    },
    {
      "id": 2,
      "title": "Portfolio Website V2",
      "description": "",
      "tags": ["Next.js", "React", "Redux", "TypeScript", "Tailwind"],
      "url": "https://website-portfolio-9bb01.web.app/",
      "github": "https://github.com/itsNairr/WebsitePortfolio"
    },
    {
      "id": 3,
      "title": "Portfolio Website V1",
      "description": "One of my first projects, this is my old portfolio website. It is built with React and JavaScript with styling done in vanilla CSS. It is crazy to see how much I have improved since then, but I am still proud of this project as it was my first time using React.js.",
      "tags": ["React", "JavaScript", "HTML", "CSS"],
      "url": "https://website-portfolio-9bb01.web.app/",
      "github": "https://github.com/itsNairr/WebsitePortfolio",
      "images": ["hn1.png","hn2.png","hn3.png"]
    },
    {
      "id": 4,
      "title": "Maze Generator and Solver",
      "description": "Utilized the recursive backtracking algorithm to design and develop a Maze Generator and Solver in C++, incorporating heuristics to identify the most efficient path to successfully traverse the maze. Applied stacks and graph-like structures to enable optimal coding and debugging. Displayed and rendered graphics using the Raylib library.",
      "tags": ["C/C++", "Raylib"],
      "github": "https://github.com/itsNairr/Maze-Solver-Generator",
      "images": ["maze.png"]
    },
    {
      "id": 5,
      "title": "Concept Website - Van Rental Site",
      "description": "Conceptual Van Rental website designed with React.js and Firebase, delivering a seamless user experience tailored to connect van owners and renters effortlessly. The platform empowers van owners with a straightforward login and posting system, contributing to a thriving van rental community.",
      "tags": ["Bun.js", "React", "Firebase"],
      "url": "https://main--splendid-youtiao-cbfd1d.netlify.app/",
      "github": "https://github.com/itsNairr/VanRentalSite"
    },
    {
      "id": 6,
      "title": "Robotic Assistive Arm Prototype",
      "tags": ["Arduino", "SOLIDWORKS", "Circuits"],
      "description": "In my first year course, APSC-101, me and three others were formed in a group to create a working robotic assistive arm that functioned to lift various objects for those who had disabilities. The project included various implications such as complex problem solving, high degree of mathematical modeling, precise CAD designing, and Arduino coding and wiring. Combining everything together, a final, functioning protype will be created."
    },
    {
      "id": 7,
      "title": "Autonomous Loader Robot",
      "tags": ["Arduino", "Circuits"],
      "description": "Engineered an autonomous robot that was able to independently traverse a test arena while transporting parts. Leveraging C and Arduino coding, I was able to power the robot with a 5V battery connected to a breadboard, complemented by range sensors and a line follower for navigation. As a result, I was able to create a working prototype that successfully completed its assigned tasks."
    }
  ]
}
